Canvas-Go/app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save
---
INSERT INTO "orders" ("border", "created_at", "fancy_edges", "image", "rolled_canvas", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["border", nil], ["created_at", Tue, 23 Oct 2012 03:30:55 UTC +00:00], ["fancy_edges", nil], ["image", "large.png"], ["rolled_canvas", nil], ["updated_at", Tue, 23 Oct 2012 03:30:55 UTC +00:00]]